<?php
include("header.php");
?>
      <div class="mainbar">
        <div class="article">
          <h2>个人网络选拔赛规则</h2><div class="clr"></div>
<ol>
<li>选手以个人为单位参赛，完成一定编程试题；</li>
<li>选手通过北师大校内网参赛，自备计算机、开发软件和上网环境。</li>
<li>竞赛中命题8-10题，题目用中文描述。</li>
<li>竞赛允许使用的编程语言为C、C++和java。</li>
<li>竞赛的预定时间为14小时（实际需要的解题时间远不需要一直都在做，主要为了照顾各位同学不同的空闲时间段）。但当竞赛进行一定时间后，竞赛主任可以因为出现不可预见的事件而调整比赛时间长度，一旦比赛时间长度发生改变，将会以及时并且统一的方式通告所有参赛队员。</li>
<li>参赛队员有权利通过提交解释请求，针对试题描述中的不明确或错误的部分在竞赛提问版提问。如果裁判确认试题中确实存在不明确或错误的部分，将会通告所有参赛队伍进行声明或更正。</li>
<li>当参赛队伍出现妨碍比赛正常进行的行为时，诸如攻击比赛系统，盗取他人登录密码和源代码、干扰他人比赛等，都将会被竞赛主任剥夺参赛资格。</li>
</ol>
        </div>
        <div class="article">
          <h2>现场决赛规则</h2><div class="clr"></div>
<ol>
<li>选手以队为单位参赛，完成一定编程试题。</li>
<li>所有参赛队集中在同一场地使用配置相同的硬件和软件设备参赛。</li>
<li>每个参赛队由两人组成，每队拥有两台计算机。</li>
<li>竞赛中命题8-12题，题目用中文描述。</li>
<li>竞赛允许使用的编程语言为C、C++和java。</li>
<li>竞赛的预定时间为5小时，但当竞赛进行一定时间后，竞赛主任可以因为出现不可预见的事件而调整比赛时间长度，一旦比赛时间长度发生改变，将会以及时并且统一的方式通告所有参赛队员。</li>
<li>参赛队员可以携带诸如书、手册、程序清单等纸质参考资料。参赛队员不得携带任何磁盘、光盘、优盘等存储设备。不得使用带有存储功能的计算器。</li>
<li>参赛队员不能携带任何类型的通讯工具，包括无线电接收器、移动电话等。在竞赛中，参赛队员不得通过网络工具（如Email、BBS等）以及任何其他方式与指定工作人员以外的人员交流。比赛中如发现违规行为，将立即取消整个队伍的参赛资格，情况严重时，通报教务处及所属院系。</li>
<li>参赛队员有权利通过提交解释请求，针对试题描述中的不明确或错误的部分在竞赛提问版提问。如果裁判确认试题中确实存在不明确或错误的部分，将会通告所有参赛队伍进行声明或更正。</li>
<li>当参赛队伍出现妨碍比赛正常进行的行为时，诸如擅自移动赛场中的设备，未经授权修改比赛软硬件，攻击比赛系统，盗取他人登录密码和源代码、干扰他人比赛等，都将会被竞赛主任剥夺参赛资格。</li>
</ol>
        </div>
        <div class="article">
          <h2>现场决赛评分标准</h2><div class="clr"></div>
<ol>
<li>试题的解答提交裁判称为运行，每一次运行会被判为正确或者错误，评判结果会及时通知参赛选手。评判通过竞赛评判软件自动进行。</li>
<li>竞赛根据正确解题数目进行排名。在决定获奖的选手时，如果多名选手正确解题数量相同，则根据总用时加上惩罚时间进行排名。总用时和惩罚时间由每道解答正确的试题的用时加上惩罚时间而成。每道试题用时将从竞赛开始到试题解答被判定为正确为止，其间每一次错误的运行将被加罚20分钟时间，未正确解答的试题不记时。</li>
<li>
参赛队可能收到的反馈信息包括：
                    <table class="orglist">
                        <tr>
                          <th>反馈信息</th>
                          <th>信息含义</th>
                        </tr>
                        <tr>
                          <td>&quot;Waiting&quot;</td>
                          <td>系统正在判题，请刷新当前页面</td>
                        </tr>
                        <tr>
                          <td>&quot;Accepted&quot;</td>
                          <td>恭喜恭喜！答案正确</td>
                        </tr>
                        <tr>
                          <td>&quot;Presentation Error&quot;</td>
                          <td>输出格式不对，可检查空格、回车等等细节。</td>
                        </tr>
                        <tr>
                          <td>&quot;Wrong Answer&quot;</td>
                          <td>答案错误。同志仍需努力</td>
                        </tr>
                        <tr>
                          <td>&quot;Runtime Error&quot;</td>
                          <td>程序运行过程中出现非正常中断。</td>
                        </tr>
                        <tr>
                          <td>&quot;Time Limit Exceed&quot;</td>
                          <td>运行超过时限还没有得到输出结果。</td>
                        </tr>
                        <tr>
                          <td>&quot;Memory Limit Exceed&quot;</td>
                          <td>内存使用量超过裁判规定的上限。</td>
                        </tr>
                        <tr>
                          <td>&quot;Output Limit Exceeded&quot;</td>
                          <td>输出数据量过大，多半死循环了……</td>
                        </tr>
                        <tr>
                          <td>&quot;Compile Error&quot;</td>
                          <td>程序不能通过编译。</td>
                        </tr>
                    </table>

</li>
</ol>
        </div>
      </div>
<?php
include("footer.php");
?>

<script type="text/javascript">
$(".menu_nav #rule").addClass("active");
</script>
